name: "mxnet-model"

input: "data"
input_dim: 1
input_dim: 3
input_dim: 320
input_dim: 320
layer {
  name: "fpganet0_features_conv0_fwd_bscale"
  type: "Scale"
  bottom: "data"
  top: "data_b0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_conv0_fwd"
  type: "Convolution"
  bottom: "data_b0"
  top: "fpganet0_features_conv0_fwd_a0"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1
    stride: 2
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_conv0_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_conv0_fwd_a0"
  top: "fpganet0_features_conv0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_relu0_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_conv0_fwd"
  top: "fpganet0_features_relu0_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck0_conv0_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_relu0_fwd"
  top: "fpganet0_features_linearbottleneck0_conv0_fwd_a3"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck0_conv0_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck0_conv0_fwd_a3"
  top: "fpganet0_features_linearbottleneck0_conv0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck0_relu0_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck0_conv0_fwd"
  top: "fpganet0_features_linearbottleneck0_relu0_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck0_conv1_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck0_relu0_fwd"
  top: "fpganet0_features_linearbottleneck0_conv1_fwd_a6"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 32
    stride: 1
    engine: CAFFE
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck0_conv1_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck0_conv1_fwd_a6"
  top: "fpganet0_features_linearbottleneck0_conv1_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck0_relu1_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck0_conv1_fwd"
  top: "fpganet0_features_linearbottleneck0_relu1_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck0_conv2_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck0_relu1_fwd"
  top: "fpganet0_features_linearbottleneck0_conv2_fwd_a9"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck0_conv2_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck0_conv2_fwd_a9"
  top: "fpganet0_features_linearbottleneck0_conv2_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck1_conv0_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck0_conv2_fwd"
  top: "fpganet0_features_linearbottleneck1_conv0_fwd_a11"
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck1_conv0_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck1_conv0_fwd_a11"
  top: "fpganet0_features_linearbottleneck1_conv0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck1_relu0_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck1_conv0_fwd"
  top: "fpganet0_features_linearbottleneck1_relu0_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck1_conv1_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck1_relu0_fwd"
  top: "fpganet0_features_linearbottleneck1_conv1_fwd_a14"
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 96
    stride: 2
    engine: CAFFE
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck1_conv1_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck1_conv1_fwd_a14"
  top: "fpganet0_features_linearbottleneck1_conv1_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck1_relu1_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck1_conv1_fwd"
  top: "fpganet0_features_linearbottleneck1_relu1_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck1_conv2_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck1_relu1_fwd"
  top: "fpganet0_features_linearbottleneck1_conv2_fwd_a17"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck1_conv2_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck1_conv2_fwd_a17"
  top: "fpganet0_features_linearbottleneck1_conv2_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck2_conv0_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck1_conv2_fwd"
  top: "fpganet0_features_linearbottleneck2_conv0_fwd_a19"
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck2_conv0_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck2_conv0_fwd_a19"
  top: "fpganet0_features_linearbottleneck2_conv0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck2_relu0_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck2_conv0_fwd"
  top: "fpganet0_features_linearbottleneck2_relu0_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck2_conv1_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck2_relu0_fwd"
  top: "fpganet0_features_linearbottleneck2_conv1_fwd_a22"
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 96
    stride: 1
    engine: CAFFE
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck2_conv1_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck2_conv1_fwd_a22"
  top: "fpganet0_features_linearbottleneck2_conv1_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck2_relu1_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck2_conv1_fwd"
  top: "fpganet0_features_linearbottleneck2_relu1_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck2_conv2_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck2_relu1_fwd"
  top: "fpganet0_features_linearbottleneck2_conv2_fwd_a25"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck2_conv2_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck2_conv2_fwd_a25"
  top: "fpganet0_features_linearbottleneck2_conv2_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck2_batchnorm0_fwd"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck1_conv2_fwd"
  top: "fpganet0_features_linearbottleneck2_batchnorm0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck2_elemwise_add0"
  type: "Eltwise"
  bottom: "fpganet0_features_linearbottleneck2_conv2_fwd"
  bottom: "fpganet0_features_linearbottleneck2_batchnorm0_fwd"
  top: "fpganet0_features_linearbottleneck2_elemwise_add0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "fpganet0_features_linearbottleneck3_conv0_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck2_elemwise_add0"
  top: "fpganet0_features_linearbottleneck3_conv0_fwd_a29"
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck3_conv0_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck3_conv0_fwd_a29"
  top: "fpganet0_features_linearbottleneck3_conv0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck3_relu0_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck3_conv0_fwd"
  top: "fpganet0_features_linearbottleneck3_relu0_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck3_conv1_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck3_relu0_fwd"
  top: "fpganet0_features_linearbottleneck3_conv1_fwd_a32"
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 96
    stride: 2
    engine: CAFFE
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck3_conv1_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck3_conv1_fwd_a32"
  top: "fpganet0_features_linearbottleneck3_conv1_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck3_relu1_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck3_conv1_fwd"
  top: "fpganet0_features_linearbottleneck3_relu1_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck3_conv2_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck3_relu1_fwd"
  top: "fpganet0_features_linearbottleneck3_conv2_fwd_a35"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck3_conv2_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck3_conv2_fwd_a35"
  top: "fpganet0_features_linearbottleneck3_conv2_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck4_conv0_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck3_conv2_fwd"
  top: "fpganet0_features_linearbottleneck4_conv0_fwd_a37"
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck4_conv0_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck4_conv0_fwd_a37"
  top: "fpganet0_features_linearbottleneck4_conv0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck4_relu0_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck4_conv0_fwd"
  top: "fpganet0_features_linearbottleneck4_relu0_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck4_conv1_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck4_relu0_fwd"
  top: "fpganet0_features_linearbottleneck4_conv1_fwd_a40"
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 192
    stride: 1
    engine: CAFFE
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck4_conv1_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck4_conv1_fwd_a40"
  top: "fpganet0_features_linearbottleneck4_conv1_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck4_relu1_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck4_conv1_fwd"
  top: "fpganet0_features_linearbottleneck4_relu1_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck4_conv2_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck4_relu1_fwd"
  top: "fpganet0_features_linearbottleneck4_conv2_fwd_a43"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck4_conv2_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck4_conv2_fwd_a43"
  top: "fpganet0_features_linearbottleneck4_conv2_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck4_batchnorm0_fwd"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck3_conv2_fwd"
  top: "fpganet0_features_linearbottleneck4_batchnorm0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck4_elemwise_add0"
  type: "Eltwise"
  bottom: "fpganet0_features_linearbottleneck4_conv2_fwd"
  bottom: "fpganet0_features_linearbottleneck4_batchnorm0_fwd"
  top: "fpganet0_features_linearbottleneck4_elemwise_add0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "fpganet0_features_linearbottleneck5_conv0_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck4_elemwise_add0"
  top: "fpganet0_features_linearbottleneck5_conv0_fwd_a47"
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck5_conv0_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck5_conv0_fwd_a47"
  top: "fpganet0_features_linearbottleneck5_conv0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck5_relu0_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck5_conv0_fwd"
  top: "fpganet0_features_linearbottleneck5_relu0_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck5_conv1_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck5_relu0_fwd"
  top: "fpganet0_features_linearbottleneck5_conv1_fwd_a50"
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 192
    stride: 1
    engine: CAFFE
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck5_conv1_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck5_conv1_fwd_a50"
  top: "fpganet0_features_linearbottleneck5_conv1_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck5_relu1_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck5_conv1_fwd"
  top: "fpganet0_features_linearbottleneck5_relu1_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck5_conv2_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck5_relu1_fwd"
  top: "fpganet0_features_linearbottleneck5_conv2_fwd_a53"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck5_conv2_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck5_conv2_fwd_a53"
  top: "fpganet0_features_linearbottleneck5_conv2_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck5_batchnorm0_fwd"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck4_elemwise_add0"
  top: "fpganet0_features_linearbottleneck5_batchnorm0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck5_elemwise_add0"
  type: "Eltwise"
  bottom: "fpganet0_features_linearbottleneck5_conv2_fwd"
  bottom: "fpganet0_features_linearbottleneck5_batchnorm0_fwd"
  top: "fpganet0_features_linearbottleneck5_elemwise_add0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "fpganet0_features_linearbottleneck6_conv0_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck5_elemwise_add0"
  top: "fpganet0_features_linearbottleneck6_conv0_fwd_a57"
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck6_conv0_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck6_conv0_fwd_a57"
  top: "fpganet0_features_linearbottleneck6_conv0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck6_relu0_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck6_conv0_fwd"
  top: "fpganet0_features_linearbottleneck6_relu0_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck6_conv1_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck6_relu0_fwd"
  top: "fpganet0_features_linearbottleneck6_conv1_fwd_a60"
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 192
    stride: 2
    engine: CAFFE
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck6_conv1_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck6_conv1_fwd_a60"
  top: "fpganet0_features_linearbottleneck6_conv1_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck6_relu1_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck6_conv1_fwd"
  top: "fpganet0_features_linearbottleneck6_relu1_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck6_conv2_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck6_relu1_fwd"
  top: "fpganet0_features_linearbottleneck6_conv2_fwd_a63"
  convolution_param {
    num_output: 80
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck6_conv2_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck6_conv2_fwd_a63"
  top: "fpganet0_features_linearbottleneck6_conv2_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck7_conv0_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck6_conv2_fwd"
  top: "fpganet0_features_linearbottleneck7_conv0_fwd_a65"
  convolution_param {
    num_output: 480
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck7_conv0_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck7_conv0_fwd_a65"
  top: "fpganet0_features_linearbottleneck7_conv0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck7_relu0_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck7_conv0_fwd"
  top: "fpganet0_features_linearbottleneck7_relu0_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck7_conv1_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck7_relu0_fwd"
  top: "fpganet0_features_linearbottleneck7_conv1_fwd_a68"
  convolution_param {
    num_output: 480
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 480
    stride: 1
    engine: CAFFE
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck7_conv1_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck7_conv1_fwd_a68"
  top: "fpganet0_features_linearbottleneck7_conv1_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck7_relu1_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck7_conv1_fwd"
  top: "fpganet0_features_linearbottleneck7_relu1_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck7_conv2_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck7_relu1_fwd"
  top: "fpganet0_features_linearbottleneck7_conv2_fwd_a71"
  convolution_param {
    num_output: 80
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck7_conv2_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck7_conv2_fwd_a71"
  top: "fpganet0_features_linearbottleneck7_conv2_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck7_batchnorm0_fwd"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck6_conv2_fwd"
  top: "fpganet0_features_linearbottleneck7_batchnorm0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck7_elemwise_add0"
  type: "Eltwise"
  bottom: "fpganet0_features_linearbottleneck7_conv2_fwd"
  bottom: "fpganet0_features_linearbottleneck7_batchnorm0_fwd"
  top: "fpganet0_features_linearbottleneck7_elemwise_add0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "fpganet0_features_linearbottleneck8_conv0_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck7_elemwise_add0"
  top: "fpganet0_features_linearbottleneck8_conv0_fwd_a75"
  convolution_param {
    num_output: 480
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck8_conv0_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck8_conv0_fwd_a75"
  top: "fpganet0_features_linearbottleneck8_conv0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck8_relu0_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck8_conv0_fwd"
  top: "fpganet0_features_linearbottleneck8_relu0_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck8_conv1_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck8_relu0_fwd"
  top: "fpganet0_features_linearbottleneck8_conv1_fwd_a78"
  convolution_param {
    num_output: 480
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 480
    stride: 1
    engine: CAFFE
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck8_conv1_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck8_conv1_fwd_a78"
  top: "fpganet0_features_linearbottleneck8_conv1_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck8_relu1_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck8_conv1_fwd"
  top: "fpganet0_features_linearbottleneck8_relu1_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck8_conv2_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck8_relu1_fwd"
  top: "fpganet0_features_linearbottleneck8_conv2_fwd_a81"
  convolution_param {
    num_output: 80
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck8_conv2_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck8_conv2_fwd_a81"
  top: "fpganet0_features_linearbottleneck8_conv2_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck8_batchnorm0_fwd"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck7_elemwise_add0"
  top: "fpganet0_features_linearbottleneck8_batchnorm0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck8_elemwise_add0"
  type: "Eltwise"
  bottom: "fpganet0_features_linearbottleneck8_conv2_fwd"
  bottom: "fpganet0_features_linearbottleneck8_batchnorm0_fwd"
  top: "fpganet0_features_linearbottleneck8_elemwise_add0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "fpganet0_features_linearbottleneck9_conv0_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck8_elemwise_add0"
  top: "fpganet0_features_linearbottleneck9_conv0_fwd_a85"
  convolution_param {
    num_output: 480
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck9_conv0_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck9_conv0_fwd_a85"
  top: "fpganet0_features_linearbottleneck9_conv0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck9_relu0_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck9_conv0_fwd"
  top: "fpganet0_features_linearbottleneck9_relu0_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck9_conv1_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck9_relu0_fwd"
  top: "fpganet0_features_linearbottleneck9_conv1_fwd_a88"
  convolution_param {
    num_output: 480
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 480
    stride: 1
    engine: CAFFE
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck9_conv1_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck9_conv1_fwd_a88"
  top: "fpganet0_features_linearbottleneck9_conv1_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck9_relu1_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck9_conv1_fwd"
  top: "fpganet0_features_linearbottleneck9_relu1_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck9_conv2_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck9_relu1_fwd"
  top: "fpganet0_features_linearbottleneck9_conv2_fwd_a91"
  convolution_param {
    num_output: 80
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck9_conv2_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck9_conv2_fwd_a91"
  top: "fpganet0_features_linearbottleneck9_conv2_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck9_batchnorm0_fwd"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck8_elemwise_add0"
  top: "fpganet0_features_linearbottleneck9_batchnorm0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck9_elemwise_add0"
  type: "Eltwise"
  bottom: "fpganet0_features_linearbottleneck9_conv2_fwd"
  bottom: "fpganet0_features_linearbottleneck9_batchnorm0_fwd"
  top: "fpganet0_features_linearbottleneck9_elemwise_add0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "fpganet0_features_linearbottleneck10_conv0_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck9_elemwise_add0"
  top: "fpganet0_features_linearbottleneck10_conv0_fwd_a95"
  convolution_param {
    num_output: 480
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck10_conv0_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck10_conv0_fwd_a95"
  top: "fpganet0_features_linearbottleneck10_conv0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck10_relu0_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck10_conv0_fwd"
  top: "fpganet0_features_linearbottleneck10_relu0_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck10_conv1_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck10_relu0_fwd"
  top: "fpganet0_features_linearbottleneck10_conv1_fwd_a98"
  convolution_param {
    num_output: 480
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 480
    stride: 1
    engine: CAFFE
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck10_conv1_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck10_conv1_fwd_a98"
  top: "fpganet0_features_linearbottleneck10_conv1_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck10_relu1_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck10_conv1_fwd"
  top: "fpganet0_features_linearbottleneck10_relu1_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck10_conv2_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck10_relu1_fwd"
  top: "fpganet0_features_linearbottleneck10_conv2_fwd_a101"
  convolution_param {
    num_output: 80
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck10_conv2_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck10_conv2_fwd_a101"
  top: "fpganet0_features_linearbottleneck10_conv2_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck10_batchnorm0_fwd"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck9_elemwise_add0"
  top: "fpganet0_features_linearbottleneck10_batchnorm0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck10_elemwise_add0"
  type: "Eltwise"
  bottom: "fpganet0_features_linearbottleneck10_conv2_fwd"
  bottom: "fpganet0_features_linearbottleneck10_batchnorm0_fwd"
  top: "fpganet0_features_linearbottleneck10_elemwise_add0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "fpganet0_features_linearbottleneck11_conv0_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck10_elemwise_add0"
  top: "fpganet0_features_linearbottleneck11_conv0_fwd_a105"
  convolution_param {
    num_output: 480
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck11_conv0_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck11_conv0_fwd_a105"
  top: "fpganet0_features_linearbottleneck11_conv0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck11_relu0_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck11_conv0_fwd"
  top: "fpganet0_features_linearbottleneck11_relu0_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck11_conv1_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck11_relu0_fwd"
  top: "fpganet0_features_linearbottleneck11_conv1_fwd_a108"
  convolution_param {
    num_output: 480
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 480
    stride: 1
    engine: CAFFE
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck11_conv1_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck11_conv1_fwd_a108"
  top: "fpganet0_features_linearbottleneck11_conv1_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck11_relu1_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck11_conv1_fwd"
  top: "fpganet0_features_linearbottleneck11_relu1_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck11_conv2_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck11_relu1_fwd"
  top: "fpganet0_features_linearbottleneck11_conv2_fwd_a111"
  convolution_param {
    num_output: 80
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck11_conv2_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck11_conv2_fwd_a111"
  top: "fpganet0_features_linearbottleneck11_conv2_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck11_batchnorm0_fwd"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck10_elemwise_add0"
  top: "fpganet0_features_linearbottleneck11_batchnorm0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck11_elemwise_add0"
  type: "Eltwise"
  bottom: "fpganet0_features_linearbottleneck11_conv2_fwd"
  bottom: "fpganet0_features_linearbottleneck11_batchnorm0_fwd"
  top: "fpganet0_features_linearbottleneck11_elemwise_add0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "fpganet0_features_linearbottleneck12_conv0_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck11_elemwise_add0"
  top: "fpganet0_features_linearbottleneck12_conv0_fwd_a115"
  convolution_param {
    num_output: 480
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck12_conv0_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck12_conv0_fwd_a115"
  top: "fpganet0_features_linearbottleneck12_conv0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck12_relu0_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck12_conv0_fwd"
  top: "fpganet0_features_linearbottleneck12_relu0_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck12_conv1_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck12_relu0_fwd"
  top: "fpganet0_features_linearbottleneck12_conv1_fwd_a118"
  convolution_param {
    num_output: 480
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 480
    stride: 1
    engine: CAFFE
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck12_conv1_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck12_conv1_fwd_a118"
  top: "fpganet0_features_linearbottleneck12_conv1_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck12_relu1_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck12_conv1_fwd"
  top: "fpganet0_features_linearbottleneck12_relu1_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck12_conv2_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck12_relu1_fwd"
  top: "fpganet0_features_linearbottleneck12_conv2_fwd_a121"
  convolution_param {
    num_output: 80
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck12_conv2_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck12_conv2_fwd_a121"
  top: "fpganet0_features_linearbottleneck12_conv2_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck12_batchnorm0_fwd"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck11_elemwise_add0"
  top: "fpganet0_features_linearbottleneck12_batchnorm0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck12_elemwise_add0"
  type: "Eltwise"
  bottom: "fpganet0_features_linearbottleneck12_conv2_fwd"
  bottom: "fpganet0_features_linearbottleneck12_batchnorm0_fwd"
  top: "fpganet0_features_linearbottleneck12_elemwise_add0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "fpganet0_features_linearbottleneck13_conv0_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck12_elemwise_add0"
  top: "fpganet0_features_linearbottleneck13_conv0_fwd_a125"
  convolution_param {
    num_output: 480
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck13_conv0_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck13_conv0_fwd_a125"
  top: "fpganet0_features_linearbottleneck13_conv0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck13_relu0_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck13_conv0_fwd"
  top: "fpganet0_features_linearbottleneck13_relu0_fwd"
  relu_param {
  }
}
layer {
  name: "project0_conv"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck13_relu0_fwd"
  top: "project0_conv_a128"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "project0_conv_ascale"
  type: "Scale"
  bottom: "project0_conv_a128"
  top: "project0_conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck13_conv1_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck13_relu0_fwd"
  top: "fpganet0_features_linearbottleneck13_conv1_fwd_a130"
  convolution_param {
    num_output: 480
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 480
    stride: 2
    engine: CAFFE
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck13_conv1_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck13_conv1_fwd_a130"
  top: "fpganet0_features_linearbottleneck13_conv1_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck13_relu1_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck13_conv1_fwd"
  top: "fpganet0_features_linearbottleneck13_relu1_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck13_conv2_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck13_relu1_fwd"
  top: "fpganet0_features_linearbottleneck13_conv2_fwd_a133"
  convolution_param {
    num_output: 160
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck13_conv2_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck13_conv2_fwd_a133"
  top: "fpganet0_features_linearbottleneck13_conv2_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck14_conv0_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck13_conv2_fwd"
  top: "fpganet0_features_linearbottleneck14_conv0_fwd_a135"
  convolution_param {
    num_output: 960
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck14_conv0_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck14_conv0_fwd_a135"
  top: "fpganet0_features_linearbottleneck14_conv0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck14_relu0_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck14_conv0_fwd"
  top: "fpganet0_features_linearbottleneck14_relu0_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck14_conv1_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck14_relu0_fwd"
  top: "fpganet0_features_linearbottleneck14_conv1_fwd_a138"
  convolution_param {
    num_output: 960
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 960
    stride: 1
    engine: CAFFE
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck14_conv1_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck14_conv1_fwd_a138"
  top: "fpganet0_features_linearbottleneck14_conv1_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck14_relu1_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck14_conv1_fwd"
  top: "fpganet0_features_linearbottleneck14_relu1_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck14_conv2_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck14_relu1_fwd"
  top: "fpganet0_features_linearbottleneck14_conv2_fwd_a141"
  convolution_param {
    num_output: 160
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck14_conv2_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck14_conv2_fwd_a141"
  top: "fpganet0_features_linearbottleneck14_conv2_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck14_batchnorm0_fwd"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck13_conv2_fwd"
  top: "fpganet0_features_linearbottleneck14_batchnorm0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck14_elemwise_add0"
  type: "Eltwise"
  bottom: "fpganet0_features_linearbottleneck14_conv2_fwd"
  bottom: "fpganet0_features_linearbottleneck14_batchnorm0_fwd"
  top: "fpganet0_features_linearbottleneck14_elemwise_add0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "fpganet0_features_linearbottleneck15_conv0_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck14_elemwise_add0"
  top: "fpganet0_features_linearbottleneck15_conv0_fwd_a145"
  convolution_param {
    num_output: 960
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck15_conv0_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck15_conv0_fwd_a145"
  top: "fpganet0_features_linearbottleneck15_conv0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck15_relu0_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck15_conv0_fwd"
  top: "fpganet0_features_linearbottleneck15_relu0_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck15_conv1_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck15_relu0_fwd"
  top: "fpganet0_features_linearbottleneck15_conv1_fwd_a148"
  convolution_param {
    num_output: 960
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 960
    stride: 1
    engine: CAFFE
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck15_conv1_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck15_conv1_fwd_a148"
  top: "fpganet0_features_linearbottleneck15_conv1_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck15_relu1_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck15_conv1_fwd"
  top: "fpganet0_features_linearbottleneck15_relu1_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck15_conv2_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck15_relu1_fwd"
  top: "fpganet0_features_linearbottleneck15_conv2_fwd_a151"
  convolution_param {
    num_output: 160
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck15_conv2_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck15_conv2_fwd_a151"
  top: "fpganet0_features_linearbottleneck15_conv2_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck15_batchnorm0_fwd"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck14_elemwise_add0"
  top: "fpganet0_features_linearbottleneck15_batchnorm0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck15_elemwise_add0"
  type: "Eltwise"
  bottom: "fpganet0_features_linearbottleneck15_conv2_fwd"
  bottom: "fpganet0_features_linearbottleneck15_batchnorm0_fwd"
  top: "fpganet0_features_linearbottleneck15_elemwise_add0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "fpganet0_features_linearbottleneck16_conv0_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck15_elemwise_add0"
  top: "fpganet0_features_linearbottleneck16_conv0_fwd_a155"
  convolution_param {
    num_output: 960
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck16_conv0_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck16_conv0_fwd_a155"
  top: "fpganet0_features_linearbottleneck16_conv0_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck16_relu0_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck16_conv0_fwd"
  top: "fpganet0_features_linearbottleneck16_relu0_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck16_conv1_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck16_relu0_fwd"
  top: "fpganet0_features_linearbottleneck16_conv1_fwd_a158"
  convolution_param {
    num_output: 960
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 960
    stride: 1
    engine: CAFFE
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck16_conv1_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck16_conv1_fwd_a158"
  top: "fpganet0_features_linearbottleneck16_conv1_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_linearbottleneck16_relu1_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_linearbottleneck16_conv1_fwd"
  top: "fpganet0_features_linearbottleneck16_relu1_fwd"
  relu_param {
  }
}
layer {
  name: "fpganet0_features_linearbottleneck16_conv2_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck16_relu1_fwd"
  top: "fpganet0_features_linearbottleneck16_conv2_fwd_a161"
  convolution_param {
    num_output: 320
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_linearbottleneck16_conv2_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_linearbottleneck16_conv2_fwd_a161"
  top: "fpganet0_features_linearbottleneck16_conv2_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_conv1_fwd"
  type: "Convolution"
  bottom: "fpganet0_features_linearbottleneck16_conv2_fwd"
  top: "fpganet0_features_conv1_fwd_a163"
  convolution_param {
    num_output: 1280
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fpganet0_features_conv1_fwd_ascale"
  type: "Scale"
  bottom: "fpganet0_features_conv1_fwd_a163"
  top: "fpganet0_features_conv1_fwd"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fpganet0_features_relu1_fwd"
  type: "ReLU"
  bottom: "fpganet0_features_conv1_fwd"
  top: "fpganet0_features_relu1_fwd"
  relu_param {
  }
}
layer {
  name: "project1_conv"
  type: "Convolution"
  bottom: "fpganet0_features_relu1_fwd"
  top: "project1_conv_a166"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "project1_conv_ascale"
  type: "Scale"
  bottom: "project1_conv_a166"
  top: "project1_conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "bilinearresize2d0"
  type: "BilinearUpsampleQuant"
  bottom: "project1_conv"
  top: "bilinearresize2d0"
  bilinear_upsample_quant_param {
    right_shift_bits: 21
    bit_width: 8
    fixpoint_bits: 23
    alpha_int: 2070021
    multiplier_right_shift_bits: 16
    up_scale: 2
  }
}
layer {
  name: "project_concat1"
  type: "Concat"
  bottom: "project0_conv"
  bottom: "bilinearresize2d0"
  top: "project_concat1"
  concat_param {
    axis: 1
  }
}
layer {
  name: "extra_dw_conv"
  type: "Convolution"
  bottom: "fpganet0_features_relu1_fwd"
  top: "extra_dw_conv_a170"
  convolution_param {
    num_output: 1280
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1280
    stride: 2
    engine: CAFFE
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "extra_dw_conv_ascale"
  type: "Scale"
  bottom: "extra_dw_conv_a170"
  top: "extra_dw_conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "extra_project_relu"
  type: "ReLU"
  bottom: "extra_dw_conv"
  top: "extra_project_relu"
  relu_param {
  }
}
layer {
  name: "project2_conv"
  type: "Convolution"
  bottom: "extra_project_relu"
  top: "project2_conv_a173"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "project2_conv_ascale"
  type: "Scale"
  bottom: "project2_conv_a173"
  top: "project2_conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "bilinearresize2d1"
  type: "BilinearUpsampleQuant"
  bottom: "project2_conv"
  top: "bilinearresize2d1"
  bilinear_upsample_quant_param {
    right_shift_bits: 21
    bit_width: 8
    fixpoint_bits: 23
    alpha_int: 2123945
    multiplier_right_shift_bits: 16
    up_scale: 4
  }
}
layer {
  name: "project_concat2"
  type: "Concat"
  bottom: "project_concat1"
  bottom: "bilinearresize2d1"
  top: "project_concat2"
  concat_param {
    axis: 1
  }
}
layer {
  name: "concat_relu"
  type: "ReLU"
  bottom: "project_concat2"
  top: "concat_relu"
  relu_param {
  }
}
layer {
  name: "fused_project_conv"
  type: "Convolution"
  bottom: "concat_relu"
  top: "fused_project_conv_a178"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    paramq: 8
    scale_in: 1.0
  }
}
layer {
  name: "fused_project_conv_ascale"
  type: "Scale"
  bottom: "fused_project_conv_a178"
  top: "fused_project_conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "convpredictor0_conv0_fwd_0shared"
  type: "Convolution"
  bottom: "fused_project_conv"
  top: "convpredictor0_conv0_fwd_0shared"
  convolution_param {
